In [147]:
import pandas as pd
df = pd.read_csv("train.csv")
print("sonamu")

sonamu

In [148]:
pd.__version__

'2.3.3'

In [149]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [150]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [151]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [152]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [153]:
# df['age'] == df['age'].astype('int')

#The above exception was the direct cause of the following exception

In [154]:
#범주형은 보통 얘로 본다! value_counts 
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [155]:
df['IsAdult'] = df['Age'] >= 18
adult_df = df[df['IsAdult']]

In [156]:
df['IsAdult'] = df['Age'] >= 18
df['IsAdult']
#Bool형 series

0       True
1       True
2       True
3       True
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: IsAdult, Length: 891, dtype: bool

In [157]:
adult_df = df[df['IsAdult']]
adult_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,601.000000,601.000000,601.000000,601.000000,601.000000,601.000000,601.000000
mean,452.224626,0.381032,2.171381,33.583195,0.334443,0.314476,35.347642
std,254.728694,0.486045,0.849851,12.185705,0.577028,0.811957,55.924013
min,1.000000,0.000000,1.000000,18.000000,0.000000,0.000000,0.000000
25%,233.000000,0.000000,1.000000,24.000000,0.000000,0.000000,8.050000
50%,451.000000,0.000000,2.000000,31.000000,0.000000,0.000000,13.858300
75%,672.000000,1.000000,3.000000,40.000000,1.000000,0.000000,33.000000
max,891.000000,1.000000,3.000000,80.000000,3.000000,6.000000,512.329200

In [158]:
# df2 = pd.read_csv(
#     "train.csv",
#     parse_dates=['BoardedDate'],    # 날짜 컬럼 지정 
# )

In [159]:
# pd.to_datetime(df2['BoardedDate'], errors = 'coerse')
# #errors : 결측이 있을 시

In [160]:
type(df['Age'])

pandas.core.series.Series

In [161]:
s = pd.Series(["소나무", "버섯", "꽃"], index=['a', 'b', 'c'], name='forest')   #리스트 형태로 인덱스 지정, 이름 지정

In [162]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [163]:
s1 = pd.Series([100, 200], index=['A','B'])
s2 = pd.Series([1, 2],     index=['B','C'])

print(s1 + s2)
#짝꿍 안맞춰지면 NaN 됨
# series는 위치가 아니라 '라벨' 기준으로 계산되기 때문에 위치 달라도 라벨로 계산

A      NaN
B    201.0
C      NaN
dtype: float64

In [164]:
df3 = pd.DataFrame({'name': ['blue', 'red', 'pink'], 'age':[50, 30, 33], 'sex':['female', 'male', 'female']})    #딕셔너리쓴

In [165]:
df3.head

<bound method NDFrame.head of    name  age     sex
0  blue   50  female
1   red   30    male
2  pink   33  female>

In [166]:
df3.head()

   name  age     sex
0  blue   50  female
1   red   30    male
2  pink   33  female

In [167]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   sex     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [168]:
df3.describe() #수치형 변수들에 대한 통계

             age
count   3.000000
mean   37.666667
std    10.785793
min    30.000000
25%    31.500000
50%    33.000000
75%    41.500000
max    50.000000

In [169]:
df3.value_counts()   #이거보다

name  age  sex
blue  50   female    1
pink  33   female    1
red   30   male      1
Name: count, dtype: int64

In [170]:
df3['name'].value_counts #이거자주씀

<bound method IndexOpsMixin.value_counts of 0    blue
1     red
2    pink
Name: name, dtype: object>

df / df['age'] / df[['age']]
df / series / df

[]가 겹쳐지면 series로 격하
따라서 시리즈는 df['age'], 나머지는 데이터프레임

In [171]:
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [172]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [173]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,IsAdult
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,True
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,True
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,True

In [174]:
df.loc[3, 'Age']

df.loc[2]

PassengerId                         3
Survived                            1
Pclass                              3
Name           Heikkinen, Miss. Laina
Sex                            female
Age                              26.0
SibSp                               0
Parch                               0
Ticket               STON/O2. 3101282
Fare                            7.925
Cabin                             NaN
Embarked                            S
IsAdult                          True
Name: 2, dtype: object

In [175]:
df.iloc[2, 3]

df.iloc[1, 8]
df.iloc[4]

PassengerId                           5
Survived                              0
Pclass                                3
Name           Allen, Mr. William Henry
Sex                                male
Age                                35.0
SibSp                                 0
Parch                                 0
Ticket                           373450
Fare                               8.05
Cabin                               NaN
Embarked                              S
IsAdult                            True
Name: 4, dtype: object

In [176]:
# df.iloc[1, 0]
# df.iloc['2026-02-04', 'age']

In [177]:
df.loc[0:5, ['PassengerId', 'Name']]

   PassengerId                                               Name
0            1                            Braund, Mr. Owen Harris
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3                             Heikkinen, Miss. Laina
3            4       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5                           Allen, Mr. William Henry
5            6                                   Moran, Mr. James

In [178]:
df.iloc[0:6, [0,3,4,5]]

,PassengerId,Name,Sex,Age
0,1,"Braund, Mr. Owen Harris",male,22.0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,"Allen, Mr. William Henry",male,35.0
5,6,"Moran, Mr. James",male,NaN

In [179]:
df.loc[1:3, ['Survived', 'Name', 'Age', 'Parch']]

   Survived                                               Name   Age  Parch
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0      0
2         1                             Heikkinen, Miss. Laina  26.0      0
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0      0

In [180]:
df.iloc[1:4, [1, 3, 5, 7]]

   Survived                                               Name   Age  Parch
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0      0
2         1                             Heikkinen, Miss. Laina  26.0      0
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0      0

In [181]:
df = pd.DataFrame({
    "name": ["천준석", "어제연", "이현지", "문길래"],
    "grade": ["F", "S", "SS", "SSS" ],
    "power": ["very weak", "strong", "strong", "very strong"]}, index=[10,20,30,40])

In [182]:
# 1 : name power? 쭉 늘려서
# 2 : 어제연, S, Strong
# 3 : 천, 어, 이/ F, S, SS

In [183]:
df.loc[20:30, ["name", "power"]]
df.iloc[0:2, [1, 2]]
df.iloc[0:3, 0:2]

   name grade
10  천준석     F
20  어제연     S
30  이현지    SS

In [184]:
# # 불리언 필터
# adults = df.loc[df['Age'] >= 18, ['PassengerId','Sex','Age','Survived']]
# adults

In [185]:
# mask = (df['Pclass']==1) & (df['Sex']=='female') & (df['Age']<30)
# df.loc[mask, ['PassengerId','Pclass','Sex','Age','Survived']].head(10)